# Задача 1. Доска
# Используя новые знания о циклах и операторе end, напишите программу, которая выводит на экрану вот такую «доску»:
"""
----------
|00000000|
|00000000|
|00000000|
|00000000|
----------
"""


print ("----------")

for _ in range(4):
    print("|00000000|")

print ("----------")